{
    "Skeleton": "The human skeleton is a remarkable internal framework that forms the structural foundation of the body. Composed of approximately 206 bones in adults, it serves several crucial functions. The skeleton provides support and shape to the body, enabling us to maintain an upright posture and facilitating movement by serving as attachment points for muscles. It also plays a vital role in protecting internal organs, such as the brain, heart, and lungs, from external impacts and injuries. Beyond its structural and protective roles, the skeleton is essential for blood cell production, which occurs in the bone marrow of certain bones. Additionally, it acts as a storage system for important minerals like calcium and phosphorus, which can be released into the bloodstream as needed. Together, these functions make the skeletal system indispensable for human life and overall health.",
    "Skull": "The human skull is made up of 22 bones that form the structure of the head and protect the brain. While most of the bones in the skull are fixed, the mandible (lower jaw) is the only bone that can move, allowing for actions like chewing and speaking. When it comes to the number of bones, the skull consists of 22 bones in total, with some forming the face and others the cranium.",
    "Ribcage": "The human ribcage consists of 24 ribs (12 pairs), which serve as a protective barrier for vital organs like the heart and lungs. The ribcage plays a crucial role in safeguarding these organs while also assisting in the breathing process. The first rib is uniquely connected to the sternum (breastbone) via cartilage, unlike the other ribs, which connect directly to the sternum or indirectly via costal cartilage. Additionally, the adult human spine contains 26 vertebrae, which support the ribcage and provide structure to the back.",
    "Spine": "The human spine is a vital structure made up of five regions: cervical, thoracic, lumbar, sacral, and coccygeal. It provides structural support for the body, protects the spinal cord, and allows for flexibility and movement. The spine's role in maintaining posture and enabling activities such as bending and twisting is crucial for overall mobility and function. Without the spine's protective and supportive functions, the body would not be able to move efficiently or safely."

}